Repository: kenichisutan/canadian-budget-en-fr-sentiment-analysis
Catalog: data/corpora/federal-budget/budget-2025-en-budget-2025-fr.tmx
Source language: en_en
Languages: fr_fr

source: 2 (1) The Act is amended by adding the following after section 150.1: Marginal note: Conditions 150.2 (1) The Minister may file a return of income for a taxation year of an individual (other than a trust) resident in Canada throughout the year if the following conditions are satisfied: (a) the individual has not notified the Minister not to file a return of income for the year on the individual's behalf; (b) the individual has not filed a return of income for at least one of the three immediately preceding taxation years; (c) the individual has not filed a return of income for the year on or before the day that is 90 days after the filing-due date for the year; (d) all of the individual's income for the year, if any, was reported in an information return filed with the Minister for the year; (e) the individual's taxable income for the year does not exceed the lesser of (i) the amount determined by the formula A + B + C where A is the amount determined under subsection 118(1.1) for the year, B is the amount, if any, that may be deducted by the individual for the year under subsection 118(2), and C is the amount, if any, that may be deducted by the individual for the year under subsection 118.3(1), and (ii) the amount determined by the formula D + E + F where D is, in the case of an individual resident at the end of the year, in (A) Quebec, the amount determined for A in subparagraph (i), or (B) a province other than Quebec, the amount, if any, determined for the year under provincial income tax law similar in substance to subsection 118(1.1), E is, in the case of an individual resident at the end of the year, in (A) Quebec, the amount determined for B in subparagraph (i), or (B) a province other than Quebec, the amount, if any, determined for the year under provincial income tax law similar in substance to subsection 118(2), and F is, in the case of an individual resident at the end of the year, in (A) Quebec, the amount determined for C in subparagraph (i), or (B) a province other than Quebec, the amount, if any, determined for the year under provincial income tax law similar in substance to subsection 118.3(1); (f) the Minister has notified the individual of the information filed with the Minister for the year and the individual has not, within 90 days after the day on which the notice is mailed or sent electronically by the Minister, (i) otherwise filed a return of income for the year, or (ii) notified the Minister of corrections to be made to the information on file with the Minister that would increase the individual's taxable income for the year beyond the amount permitted under paragraph (e); and (g) the individual meets such other conditions as the Minister may specify, if any.
fr_fr: 2 (1) La même loi est modifiée par adjonction, après l'article 150.1, de ce qui suit : Note marginale : Conditions 150.2 (1) Le ministre peut produire une déclaration de revenu pour une année d'imposition d'un particulier — à l'exception d'une fiducie — qui réside au Canada tout au long de l'année si les conditions suivantes sont réunies : a) le particulier n'a pas avisé le ministre de ne pas produire une déclaration de revenu en son nom pour l'année; b) le particulier n'a pas produit de déclaration de revenu pour une ou plusieurs des trois années d'imposition précédentes; c) le particulier n'a pas produit de déclaration de revenu pour l'année dans les 90 jours suivant la date d'échéance de production qui lui est applicable pour l'année; d) la totalité du revenu éventuel du particulier pour l'année est indiquée dans une déclaration de renseignements présentée au ministre pour l'année; e) le revenu imposable du particulier pour l'année n'excède pas le moins élevé des montants suivants : (i) la somme obtenue par la formule suivante : A + B + C où : A représente le montant calculé selon le paragraphe 118(1.1) pour l'année, B le montant éventuel que le particulier peut déduire pour l'année en application du paragraphe 118(2), C le montant éventuel que le particulier peut déduire pour l'année en application du paragraphe 118.3(1), (ii) la somme obtenue par la formule suivante : D + E + F où D représente, dans le cas d'un particulier résidant à la fin de l'année, selon le cas : (A) au Québec, la valeur de l'élément A de la formule figurant au sous-alinéa (i), (B) dans une province autre que le Québec, le montant éventuel déterminé pour l'année selon la législation fiscale provinciale semblable au paragraphe 118(1.1) quant au fond, E dans le cas d'un particulier résidant à la fin de l'année, selon le cas : (A) au Québec, la valeur de l'élément B de la formule figurant au sous-alinéa (i), (B) dans une province autre que le Québec, le montant éventuel déterminé pour l'année selon la législation fiscale provinciale semblable au paragraphe 118(2) quant au fond, F dans le cas d'un particulier résidant à la fin de l'année, selon le cas : (A) au Québec, la valeur de l'élément C de la formule figurant au sous-alinéa (i), (B) dans une province autre que le Québec, le montant éventuel déterminé pour l'année selon la législation fiscale provinciale semblable au paragraphe 118.3(1) quant au fond; f) le ministre a avisé le particulier des renseignements présentés au ministre pour l'année et le particulier n'a pas, dans les 90 jours suivant la date à laquelle l'avis est envoyé par le ministre par courrier ou par voie électronique, selon le cas : (i) par ailleurs produit une déclaration de revenu pour l'année, (ii) avisé le ministre de corrections à apporter aux renseignements figurant au dossier du ministre qui augmenteraient le revenu imposable du particulier pour l'année au-delà de la somme permise par l'alinéa e); g) le particulier remplit les autres conditions éventuelles précisées par le ministre.

source: Marginal note: Invalid filing (2) If a return of income is filed under this section for a taxation year of an individual who did not meet the conditions in subsection (1), the return is deemed to have never been filed.
fr_fr: Note marginale : Production non valide (2) Si une déclaration de revenu est produite en vertu du présent article pour une année d'imposition d'un particulier qui n'a pas rempli les conditions énoncées au paragraphe (1), la déclaration est réputée ne pas avoir été produite.

source: Marginal note: Deemed filing (3) Subject to subsection (2), for the purposes of this Act, a return of income for a taxation year of an individual is deemed to have been filed by the individual at the time of its filing by the Minister in accordance with subsection (1).
fr_fr: Note marginale : Production réputée (3) Sous réserve du paragraphe (2), pour l'application de la présente loi, une déclaration de revenu pour une année d'imposition d'un particulier est réputée avoir été produite par ce dernier au moment de sa production par le ministre conformément au paragraphe (1).

source: (4) Subsection (1) applies to the 2025 and subsequent taxation years.
fr_fr: (4) Le paragraphe (1) s'applique aux années d'imposition 2025 et suivantes.

source: 1 (1) If Bill C-4, introduced in the 1st session of the 45th Parliament and entitled the Making Life More Affordable for Canadians Act , receives royal assent, then section 118 of the Income Tax Act is amended by adding the following after subsection (10): Marginal note: Top-up tax credit (11) For the purpose of computing the tax payable under this Part by an individual for a taxation year that is after 2024 and before 2031, there may be deducted the amount determined by the formula (A − B × C) × D where A is the amount determined by the formula E + F where E is the total of all amounts each of which is an amount deducted by the individual in computing the individual's tax payable for the year under this Part under any of subsections (1), (2), (3) and (10), and sections 118.01, 118.041, 118.05, 118.06, 118.07, 118.2, 118.3, 118.5, 118.61, 118.62, 118.7, 118.8 and 118.9, and F is the lesser of (a) the amount deducted by the individual in computing the individual's tax payable for the year under this Part under section 118.1, and (b) $200 multiplied by the appropriate percentage for the year; B is the appropriate percentage for the year; C is the first dollar amount for the year referred to in paragraph 117(2)(b); and D is, (a) if the taxation year is 2025, 3.45%, and (b) in any other case, 7.14%.
fr_fr: 1 (1) En cas de sanction du projet de loi C-4, déposé au cours de la 1 re session de la 45 e législature et intitulé Loi visant à rendre la vie plus abordable pour les Canadiens , l'article 118 de la Loi de l'impôt sur le revenu est modifié par adjonction, après le paragraphe (10), de ce qui suit : Note marginale : Crédit d'impôt compensatoire (11) Est déductible dans le calcul de l'impôt payable par un particulier en vertu de la présente partie pour une année d'imposition postérieure à 2024 et antérieure à 2031 la somme obtenue par la formule suivante : (A − B × C) × D où : A représente la somme obtenue par la formule suivante : E + F où : E représente le total des sommes représentant chacune une somme déduite par le particulier dans le calcul de son impôt payable pour l'année en vertu de la présente partie par l'effet de l'un des paragraphes (1), (2), (3) et (10) et des articles 118.01, 118.041, 118.05, 118.06, 118.07, 118.2, 118.3, 118.5, 118.61, 118.62, 118.7, 118.8 et 118.9, F la moins élevée des sommes suivantes : a) la somme déduite par le particulier dans le calcul de son impôt payable pour l'année en vertu de la présente partie par l'effet de l'article 118.1, b) le produit de la multiplication de 200 $ par le taux de base pour l'année; B le taux de base pour l'année; C la première somme visée à l'alinéa 117(2)b) pour l'année; D : a) si l'année d'imposition est 2025, 3,45 %, b) sinon, 7,14 %.

source: (2) Subsection (1) is deemed to have come into force on January 1, 2025.
fr_fr: (2) Le paragraphe (1) est réputé être entré en vigueur le 1 er janvier 2025.

source: 2 (1) If Bill C-4, introduced in the 1st session of the 45th Parliament and entitled the Making Life More Affordable for Canadians Act , receives royal assent, then the description of C in subsection 118.61(1) of the Income Tax Act is replaced by the following: C is the lesser of the value of B and the amount that would be the individual's tax payable under this Part for the year if no amount were deductible under this Division (other than an amount deductible under this section and any of subsections 118(1) to (10) and sections 118.01 to 118.07, 118.3 and 118.7);
fr_fr: 2 (1) En cas de sanction du projet de loi C-4, déposé au cours de la 1 re session de la 45 e législature et intitulé Loi visant à rendre la vie plus abordable pour les Canadiens , l'élément C de la formule figurant au paragraphe 118.61(1) de la Loi de l'impôt sur le revenu est remplacé par ce qui suit : C la valeur de l'élément B ou, si elle est inférieure, la somme qui correspondrait à l'impôt payable par le particulier en vertu de la présente partie pour l'année si aucune somme, sauf celles visées au présent article, à l'un des paragraphes 118(1) à (10) ou à l'un des articles 118.01 à 118.07, 118.3 et 118.7, n'était déductible en application de la présente section;

source: (2) If Bill C-4, introduced in the 1st session of the 45th Parliament and entitled the Making Life More Affordable for Canadians Act , receives royal assent, then paragraph 118.61(2)(b) of the Income Tax Act is replaced by the following: (b) the amount that would be the individual's tax payable under this Part for the year if no amount were deductible under this Division (other than an amount deductible under this section and any of subsections 118(1) to (10) and sections 118.01 to 118.07, 118.3 and 118.7).
fr_fr: (2) En cas de sanction du projet de loi C-4, déposé au cours de la 1 re session de la 45 e législature et intitulé Loi visant à rendre la vie plus abordable pour les Canadiens , l'alinéa 118.61(2)b) de la Loi de l'impôt sur le revenu est remplacé par ce qui suit : b) la somme qui correspondrait à son impôt payable en vertu de la présente partie pour l'année si aucune somme, sauf celles visées au présent article, à l'un des paragraphes 118(1) à (10) ou à l'un des articles 118.01 à 118.07, 118.3 et 118.7, n'était déductible en application de la présente section.

source: (3) Subsections (1) and (2) are deemed to have come into force on January 1, 2025.
fr_fr: (3) Les paragraphes (1) et (2) sont réputés être entrés en vigueur le 1 er janvier 2025.

source: 1 (1) Paragraph 108(2)(c) of the Act is replaced by the following: (c) the fair market value of the property of the trust at the end of 1993 was primarily attributable to real property or an interest in real property — or to immovables or a real right in immovables — and the trust was a unit trust throughout any calendar year that ended before 1994 and the fair market value of the property of the trust at the particular time is primarily attributable to property described in paragraph (a) or subparagraph (c)(i) of the definition qualified investment in subsection 207.01(1), real property or an interest in real property — or immovables or a real right in immovables — or any combination of those properties.
fr_fr: 1 (1) Le sous-alinéa 108(2)c)(iii) de la même loi est remplacé par ce qui suit : (iii) la juste valeur marchande de ses biens au moment donné est principalement attribuable à des biens visés à l'alinéa a) ou au sous-alinéa c)(i) de la définition de placement admissible au paragraphe 207.01(1), à des immeubles — ou droits réels sur ceux-ci — ou des biens réels — ou intérêts sur ceux-ci — ou à l'un et l'autre de ces types de biens.

source: (2) Subsection (1) comes into force on January 1, 2027.
fr_fr: (2) Le paragraphe (1) entre en vigueur le 1 er janvier 2027.

source: 2 (1) Paragraph (a) of the definition qualified REIT property in subsection 122.1(1) of the Act is replaced by the following: (a) a real or immovable property that is capital property, an eligible resale property, an indebtedness of a Canadian corporation represented by a bankers' acceptance, a property described in paragraph (a) or subparagraph (c)(i) of the definition qualified investment in subsection 207.01(1) or a deposit with a credit union;
fr_fr: 2 (1) L'alinéa a) de la définition de bien admissible de FPI , au paragraphe 122.1(1) de la même loi, est remplacé par ce qui suit : a) un bien immeuble ou réel qui est une immobilisation, un bien de revente admissible, une dette d'une société canadienne représentée par une acceptation bancaire, un bien visé à l'alinéa a) ou au sous-alinéa c)(i) de la définition de placement admissible au paragraphe 207.01(1) ou un dépôt auprès d'une caisse de crédit;

source: (2) Paragraph (d) of the definition real estate investment trust in subsection 122.1(1) of the Act is replaced by the following: (d) at each time in the taxation year an amount, that is equal to 75% or more of the equity value of the trust at that time, is the amount that is the total fair market value of all properties held by the trust each of which is a real or immovable property that is capital property, an eligible resale property, an indebtedness of a Canadian corporation represented by a bankers' acceptance, a property described in paragraph (a) or subparagraph (c)(i) of the definition qualified investment in subsection 207.01(1) or a deposit with a credit union; and
fr_fr: (2) L'alinéa d) de la définition de fiducie de placement immobilier , au paragraphe 122.1(1) de la même loi, est remplacé par ce qui suit : d) la juste valeur marchande totale des biens qu'elle détient, dont chacun est un bien immeuble ou réel qui est une immobilisation, un bien de revente admissible, une dette d'une société canadienne représentée par une acceptation bancaire, un bien visé à l'alinéa a) ou au sous-alinéa c)(i) de la définition de placement admissible au paragraphe 207.01(1) ou un dépôt auprès d'une caisse de crédit, n'est à aucun moment de l'année inférieure à 75 % de la valeur de ses capitaux propres au moment considéré;

source: (3) Subsections (1) and (2) come into force on January 1, 2027.
fr_fr: (3) Les paragraphes (1) et (2) entrent en vigueur le 1 er janvier 2027.

source: 3 (1) Paragraph 132.2(3)(h) of the Act is replaced by the following: (h) where a share to which paragraph (g) applies would, if this Act were read without reference to this paragraph, cease to be a qualified investment (as defined in section 204 or subsection 207.01(1)) as a consequence of the qualifying exchange, the share is deemed to be a qualified investment until the earlier of the day that is 60 days after the day that includes the transfer time and the time at which it is disposed of in accordance with paragraph (g);
fr_fr: 3 (1) L'alinéa 132.2(3)h) de la même loi est remplacé par ce qui suit : h) l'action à laquelle s'applique l'alinéa g) et qui cesserait, en l'absence du présent alinéa, d'être un placement admissible , au sens de l'article 204 ou du paragraphe 207.01(1), par suite de l'échange admissible est réputée être un tel placement jusqu'au soixantième jour suivant le jour qui comprend le moment du transfert ou, s'il est antérieur, jusqu'au moment où elle fait l'objet d'une disposition en conformité avec l'alinéa g);

source: (2) Subsections (1) comes into force on January 1, 2027.
fr_fr: (2) Le paragraphe (1) entre en vigueur le 1 er janvier 2027.

source: 4 (1) Subparagraph (g)(iii) of the definition eligible trust in subsection 135.2(1) of the Act is replaced by the following: (iii) property described in paragraph (a) or subparagraph (c)(i) of the definition qualified investment in subsection 207.01(1) or a deposit with a credit union;
fr_fr: 4 (1) Le sous-alinéa g)(iii) de la définition de fiducie admissible , au paragraphe 135.2(1) de la même loi, est remplacé par ce qui suit : (iii) un bien visé à l'alinéa a) ou au sous-alinéa c)(i) de la définition de placement admissible au paragraphe 207.01(1) ou un dépôt auprès d'une caisse de crédit;

source: 5 (1) The definition qualified investment in subsection 146(1) of the Act is repealed.
fr_fr: 5 (1) La définition de placement admissible , au paragraphe 146(1) de la même loi, est abrogée.

source: (2) Subparagraph 146(4)(b)(ii) of the Act is replaced by the following: (ii) such portion of the amount determined under subparagraph (i) in respect of the trust for the year as can reasonably be considered to be income from, or from the disposition of, a qualified investment (as defined in subsection 207.01(1)) for the trust; and
fr_fr: (2) Le sous-alinéa 146(4)b)(ii) de la même loi est remplacé par ce qui suit : (ii) la partie du montant déterminé selon le sous-alinéa (i) à l'égard de la fiducie pour l'année, qu'il est raisonnable de considérer comme un revenu provenant soit d'un placement admissible (au sens du paragraphe 207.01(1)) pour elle, soit de la disposition d'un tel placement;

source: 6 (1) The definition qualified investment in subsection 146.1(1) of the Act is repealed.
fr_fr: 6 (1) La définition de placement admissible , au paragraphe 146.1(1) de la même loi, est abrogée.

source: (2) The portion of subsection 146.1(5) of the Act before paragraph (a) is replaced by the following: Marginal note: Trust not taxable (5) No tax is payable under this Part by a trust that is governed by a RESP on its taxable income for a taxation year, except that, if at any time in the taxation year, it holds a property that is a non-qualified investment (as defined in subsection 207.01(1)) for the trust, tax is payable under this Part by the trust on the amount that would be its taxable income for the taxation year if it had no income or losses from sources other than non-qualified investments, and no capital gains or capital losses other than from dispositions of non-qualified investments, and for that purpose,
fr_fr: (2) Le passage du paragraphe 146.1(5) de la même loi précédant l'alinéa a) est remplacé par ce qui suit : Note marginale : Fiducie non imposable (5) Aucun impôt n'est à payer en vertu de la présente partie par une fiducie régie par un REEE sur son revenu imposable pour une année d'imposition. Toutefois, si, au cours de l'année, la fiducie détient un bien qui est un placement non admissible (au sens du paragraphe 207.01(1)) pour elle, l'impôt prévu par la présente partie est à payer par elle sur la somme qui serait son revenu imposable pour l'année si elle n'avait pas tiré de revenu, ni subi de perte, de sources autres que des placements non admissibles ni n'avait de gains en capital ou de pertes en capital ne provenant pas de la disposition de tels placements, et à cette fin :

source: 7 (1) The definition qualified investment in subsection 146.3(1) of the Act is repealed.
fr_fr: 7 (1) La définition de placement admissible , au paragraphe 146.3(1) de la même loi, est abrogée.

source: (2) The description of A in the definition minimum amount in subsection 146.3(1) of the Act is replaced by the following: A is the total fair market value of all properties held in connection with the fund at the beginning of the year (other than annuity contracts held by the plan trust that, at the beginning of the calendar year, are described in paragraph (j) of the definition qualified investment in subsection 207.01(1));
fr_fr: (2) L'élément A de la formule figurant à la définition de minimum , au paragraphe 146.3(1) de la même loi, est remplacé par ce qui suit : A représente la juste valeur marchande totale des biens détenus dans le cadre du fonds au début de l'année, à l'exception des contrats de rente détenus par une fiducie régie par le fonds et qui, au début de l'année, sont visés à l'alinéa j) de la définition de placement admissible au paragraphe 207.01(1);

source: (3) Paragraph (a) of the description of C in the definition minimum amount in subsection 146.3(1) of the Act is replaced by the following: (a) a periodic payment under an annuity contract described in paragraph (j) of the definition qualified investment in subsection 207.01(1) that is held by the trust at the beginning of the year and is paid to the trust in the year, or
fr_fr: (3) L'alinéa a) de l'élément C de la formule figurant à la définition de minimum , au paragraphe 146.3(1) de la même loi, est remplacé par ce qui suit : a) un paiement périodique prévu par un contrat de rente détenu par la fiducie au début de l'année visé à l'alinéa j) de la définition de placement admissible au paragraphe 207.01(1) qui est versé à la fiducie au cours de l'année,
